          Конспект 02.09.2022

В пятницу делимся на две подгруппы. Одна идёт на ТОИ, вторая — на программирование. В пятницу группа Анны Олеговны идёт на программирование, группа Ирины Вениаминовны — на ТОИ, в понедельник(?) — наоборот;

На ТОИ мы будем готовиться к ЕГЭ. Несмотря на название, практика там тоже вполне себе будет. Так как ЕГЭ полностью делается на компьютере, мы будем к нему готовиться на них же. ЕГЭ по информатике сильно сложнее, чем ОГЭ. Надо уметь программировать и знать алгоритмы;
В этом году будем вспоминать Python и решать задачи на нём, потому что, как показывает практика, на нём задачи делать лучше всего. Возможно, будет небольшое введение  в Плюсы.

    Что будем изучать
  Информация и процессы
  Обработка числовых данных /*во многом — Excel*/
  Системы счисления
  Логика и компьютер  /*самая страшная тема года. Логические операции и так далее*/
  Комбинаторика /*решается Питоном без проблем*/
  Pyhton  /*Если успеем*/
  {
    Динамическое программирование
    Оптимизация кода
  }

По программированию будут два преподаавателя — Анна Олеговна и Николай Константинович;
Информатика и ТПП иногда будут меняться местами;
